package test;

public class Bronze {
	public static void main(String[] args) {
		//System.out.println("こんにちは。");
		

//		1日目
//		1、javaの概要
//		2、変数、データ型、演算子
		
//		
//		1-4 プログラミングを始める
//
//		字下げはTabキーを押す。スペースで字下げしない。
//		因みに、MacのタブキーはQの左隣
//		
//		1-5  javaのプログラムが動く仕組み
//		Point!
//		・コンパイルとはコンピュータがソースコードを理解できるように翻訳すること
//		・コンパイルするための翻訳プログラムのことを「コンパイラ」という
//		・コンパイラを2回行い2回目のコンパイルはプログラムの実行時にJVMを使ってマシン語に翻訳している。
//		
//		翻訳作業のことを「コンパイル」
//		翻訳前のコードを「ソースコード」
//		ソースコードをコンパイルするための翻訳プログラムのことを「コンパイラ」と呼ぶ。
//		
//		1-6 プログラムを構成するもの
//		point!
//		・1つのプログラム部品のことを「クラス」という。
//		・ブロックとはコードの塊を表す集合体のことで「{」から「}」で表す。
//		・コード中の命令のことを「ステートメント」
//		プログラムの実行中に扱うデータのことを「リテラル」　という。
//		
		//・数値　ダブルクォーテーション「”」なしで記述できる。
		//・文字列　　ダブルクォーテーション「”」で括らなければいけない
//		
//		「”」で括ることでデータ型であることを明確に示している。
//		
//		2,変数、データ型、演算子
//		point!
//		・変数名　人が理解しやすいようにメモリアドレスにつける別名のこと
//		・変数名を使って実際のメモリアドレスを参照し
//		そこにあるデータにアクセスできるようにする仕組みのことを「変数」という。
//		・8種類のプリミティブ型	（short型、byte型、long型、int型、double型、float型、char型、boolean型）
//		のデータ型が用意されている。
//		・変数は宣言したのちに初期化することによって使うことができるようになる。
//		
		
//		
//		データ型は、プリミティブ型、オブジェクト型、列挙型の３つに分類される。
//		最も基本となるプリミティブ型を学ぶ。
//		基本データ型　とも呼ばれる。
//		
//		プリミティブ型
		
		
		
		
		
		
		
		
		
		
		
		
//		
//		2-2,　算術演算子
//		point!
//		
//		P50~
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}
}