package test;

public class Selfstudy {
	public static void main(String[] args) {
//		if (args.length != 0) {
		System.out.println("emi");
		//System.out.println("Hello");     //「Hello」という名前のクラス
		}
	}


//1、javaの概要
//プログラミング言語「Java」の特徴や歴史、エディションについて学ぶ。
//
//2、変数、データ型、演算子
//変数とは何か、変数の使い方など学び、簡単な演算プログラムを作る。
//
//1-1 Javaの歴史と特徴
//・一度書いたら、どこでも動く
//・オブジェクト指向プログラミングの方法論を採用している。
//・ネットワークを扱う機能を標準で備えている。
//・分散システムを扱う機能を標準で備えている。
//
//1-2
//Javaの種類と開発環境
//・Javaでソフトウェアを開発するにはJDKが必要。
//・JavaにはSE/EE/MEという3つのエディションが必要であるが
//JavaEE/MEを使うためには最も基本となるJava/SEが必要である。
//
//Java EE　（エンタープライズ・アプリケーション用）
//Java　ME　（組み込みや携帯電話用）
//Java SE　（基本的な機能を提供）

//1-3 Javaの開発環境を準備する
//（感想のみ）
//JDKインストールと環境変数の設定⇨この作業に役2.5時間
//かかってしまった。。
//ダウンロードより環境変数の設定に苦戦した。
//まだ理解が遅かったが徐々に自分で気づけて良かった。（ChatGPTありがとう）
//
////1-4　プログラミングを始める
//・プログラムの内容であるソースコードを作成し『java.』ファイルとして保存する。
//・コマンドプロンプトでjavacコマンドを使ってコンパイルする。
////・コンパイルされた『.class』ファイルをjavaコマンドで実行する。
//
//字下げはTABキを押して入力する。
//スペースを使って字下げしない。
//Javaは大文字と小文字を厳密に区別するのでスペルミスには注意する。

////※ソースコードを保存するファイルの拡張子は必ず「.java」にする。
//
//1-5　Javaのプログラムが動く仕組み
//・コンパイルとはコンピュータがソースコードを理解できるように翻訳することである。
//・コンパイルするための翻訳プログラムのことを「コンパイラ」という。
//・Javaではコンパイルを2回行い、2回目のコンパイルはプログラムの実行にJVMを使って翻訳している。
//
//コンピュータが理解できるように翻訳してあげる必要がある。
//この翻訳作業のことを『コンパイル』
//翻訳前のコードを「ソースコード」
//ソースコードをコンパイルするための翻訳プログラムのことを「コンパイラ」と呼ぶ。
//
//1-6　プログラムを構成するもの
//・1つのプログラム部品のことを「クラス」という。
//・ブロックとは、コードのかたまりを表す集合体のことで、
//『{」から「}』で表す。
//・コード中の命令のことを「ステートメント」、
//プログラムの実行中に扱うデータのことを「リテラル」という。

//System.out.println("emi");
//「"」ダブルクォーテーションで括られたデータが画面に表示される。
//表示したいデータが数値の場合には、「"」なしで記述できる。
//System.out.println(100);
//数値は”なし
//文字列は"あり　で記述する。


//コメント
/*       ここから
 * 　　　　コメント
 *        コメント
 */       //ここまでコメント


//インデント
//ブロックの開始を表す中カッコ『{』が始まったら次の行からタブを1つ入れる。
//閉じるカッコ『}』が出てきたら次の行では字下げを1つ戻す。
//












