		
		//Ruby,study
		
// 	    3月24日(日)
//		DMMのカリキュラム
//		復習
//		
//		Rubyを学ぼう
//		2章【Rubyの基本文法を理解しよう】
//		まで。
		
		
		//直接ソースコードからRubyをビルドしてインストールから開始。
		//本は読んだのに3/25コミットし忘れた
//		
//		https://teratail.com/questions/169281
//			この記事からやる
//		本p50まで読んだ
		
		//3/27
		//適切なgem名（gemname）を指定することからスタート
		//そもそもファイルが違うのではないか。
		
//		
//第1部　Rubyをはじめよう
//第2章　便利なオブジェクト
//第3章　コマンドを作ろう　　P68まで

//rails s できない　エラー対応から
//
//第2部　基礎を学ぼう
//第4章　オブジェクトと変数・定数
//
//4、1　オブジェクト
//数値オブジェクト
//文字列オブジェクト
//配列オブジェクト、ハッシュオブジェクト
//正規表現オブジェクト
//時刻オブジェクト
//ファイルオブジェクト
//シンボルオブジェクト
//
//4、2　クラス
//4、3　変数
//4、4　定数
//4、5　予約語
//4、6　多重代入
//
//第5章　条件判断

//論理演算子
//if文
//unless文
//case文
//
//第6章
//繰り返し
//
//第7章
//メソッド
//
//第8章
//クラスとモジュール
//vsコードのエラー対応中
//少し進歩あり


//vsコードのエラー対応中。。。


//p128まで
//第8章
//クラスとモジュール
//p141まで

//p180まで

//タイピングの練習、3時間以上
//vsコード対応中
//エラー対応中、変化あり
//まだ対応中

//タイピングの練習、ちょっと
//vsコードエラー直ったがこれじゃない泣く
//ファイルが違うのでもう一度ファイフ入れ直しからやる

//タイピングの練習

//タイピングの練習
//vsコードを対応中
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//第12章

//昨日4/13は引っ越し作業でPCに触れられなかった
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//第14章、途中
//タイピングの練習




//rails s できない　エラー対応から



//コードは土日やる



2024年4月24日から

HtML
相対パス、絶対パス
//タイピングの練習

ディレクトリーについて
レスポンシブ対応（途中）
//タイピングの練習

//タイピングの練習


