package test;

public class Selfstudy {

	
	public static void main(String[] args) {
		System.out.println("Selfstudy");

	}

}


//1、javaの概要
//プログラミング言語「Java」の特徴や歴史、エディションについて学ぶ。
//
//2、変数、データ型、演算子
//変数とは何か、変数の使い方など学び、簡単な演算プログラムを作る。
//
//1-1 Javaの歴史と特徴
//・一度書いたら、どこでも動く
//・オブジェクト指向プログラミングの方法論を採用している。
//・ネットワークを扱う機能を標準で備えている。
//・分散システムを扱う機能を標準で備えている。
//
//1-2
//Javaの種類と開発環境
//・Javaでソフトウェアを開発するにはJDKが必要。
//・JavaにはSE/EE/MEという3つのエディションが必要であるが
//JavaEE/MEを使うためには最も基本となるJava/SEが必要である。
//
//Java EE　（エンタープライズ・アプリケーション用）
//Java　ME　（組み込みや携帯電話用）
//Java SE　（基本的な機能を提供）





