		
		//Ruby,study
		
// 	    3月24日(日)
//		DMMのカリキュラム
//		復習
//		
//		Rubyを学ぼう
//		2章【Rubyの基本文法を理解しよう】
//		まで。
		
		
		//直接ソースコードからRubyをビルドしてインストールから開始。
		//本は読んだのに3/25コミットし忘れた
//		
//		https://teratail.com/questions/169281
//			この記事からやる
//		本p50まで読んだ
		
		//3/27
		//適切なgem名（gemname）を指定することからスタート
		//そもそもファイルが違うのではないか。
		
//		
//第1部　Rubyをはじめよう
//第2章　便利なオブジェクト
//第3章　コマンドを作ろう　　P68まで

//rails s できない　エラー対応から
//
//第2部　基礎を学ぼう
//第4章　オブジェクトと変数・定数
//
//4、1　オブジェクト
//数値オブジェクト
//文字列オブジェクト
//配列オブジェクト、ハッシュオブジェクト
//正規表現オブジェクト
//時刻オブジェクト
//ファイルオブジェクト
//シンボルオブジェクト
//
//4、2　クラス
//4、3　変数
//4、4　定数
//4、5　予約語
//4、6　多重代入
//
//第5章　条件判断

//論理演算子
//if文
//unless文
//case文
//
//第6章
//繰り返し
//
//第7章
//メソッド
//
//第8章
//クラスとモジュール
//vsコードのエラー対応中
//少し進歩あり


//vsコードのエラー対応中。。。


//p128まで
//第8章
//クラスとモジュール
//p141まで

//p180まで

//タイピングの練習、3時間以上
//vsコード対応中
//エラー対応中、変化あり
//まだ対応中

//タイピングの練習、ちょっと
//vsコードエラー直ったがこれじゃない泣く
//ファイルが違うのでもう一度ファイフ入れ直しからやる

//タイピングの練習

//タイピングの練習
//vsコードを対応中
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//第12章

//昨日4/13は引っ越し作業でPCに触れられなかった
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//第14章、途中
//タイピングの練習




//rails s できない　エラー対応から



//コードは土日やる



2024年4月24日から

# HTML5/CSS3
HtML
相対パス、絶対パス
//タイピングの練習

ディレクトリーについて
レスポンシブ対応（途中）
//タイピングの練習

//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習
//タイピングの練習

2024年5月1日
//タイピングの練習
.レスポンシブ対応
.ページを作成してみよう
.セレクトボックスやテキストエリア
.inputタグについて
.よく使う擬似クラス
.透明化について
.z-indexについて
.はみ出し部分の隠し方
（↑見る順番逆かも。。）

（ここから一番下の動画視聴開始）
.HTMLファイルの作り方
.DOCTYPE宣言とHTMLタグ
.headタグ
.bodyタグ
.見出しタグと段落タグ
.リンクを設置する方法（途中）


2024年5月2日
//タイピングの練習
.リンクを設置する方法

個人的にすること
→　sublime text をブラウザで見る方法
簡単な方法があってすぐ自己解決した！
解決方法
↓

Sublime Textはテキストエディタであり、ブラウザで直接表示することはできません。
ただし、Sublime Textで作成したファイル（例えば、HTMLやCSSファイルなど）は、
ブラウザで閲覧することができます。

以下の手順で、Sublime Textで作成したHTMLファイルをブラウザで表示することができます。

1,Sublime TextでHTMLファイルを開きます。
2.ファイルを保存します（Ctrl + SまたはCmd + Sを使用）。
3.保存したHTMLファイルをブラウザで開きます。一般的に、ファイルをダブルクリックするか、ブラウザのメニューから「ファイルを開く」オプションを使用します。
4.ブラウザでHTMLファイルが表示されます。
これにより、Sublime Textで編集したHTMLコードがブラウザで表示されます。
同様に、CSSファイルやJavaScriptファイルもブラウザで表示できます。

ここまで！

<img src="">
・画像を読み込む
.リストや表を作る方法

・CSSとは？


2024年5月3日
//タイピングの練習

・CSSファイルの読み込み方
・文字色と背景色
・背景画像
・フォントの指定と装飾
・文字の配置
・ブロックの幅と高さ
・余白の作り方

・境界線の作り方
・要素の表示・非表示
・要素の位置変更
・クラスとIDについて
・よくあるクラスの指定方法
・フレックスボックス❶（途中）

2024年5月4日
//タイピングの練習
・HTMLとは？　から　・よくあるクラスの指定方法　まで復習完了
・フレックスボックス❶
・フレックスボックス❷
・はみ出し部分の隠し方
・Autoについて
・リストタグの装飾
・z-indexについて
・透明化について
・よく使う擬似クラス

2024年5月5日
・inputタグについて
・セレクトボックスやテキストエリア
・ページを作成してみよう（途中）
//タイピングの練習
・ページを作成してみよう(完了)

2024年5月6日
//タイピングの練習
・レスポンシブ対応（途中）

2024年5月7日
・レスポンシブ対応（途中）
//タイピングの練習

2024年5月8日
//タイピングの練習
・レスポンシブ対応（途中）

2024年5月9日
・レスポンシブ対応
・各ファイルのディレクトリについて
・相対パス、絶対パス（途中）
//タイピングの練習

2024年5月10日
・相対パス、絶対パス
・HTML5/CSS3コース完了

# プログラミング 課題
・プログラミングとは
・学習の流れ

プログラミング学習の目安

プログラマーとして転職、または副業やフリーランスで案件を獲得するための勉強時間目安は、300～500時間以上必要と言われています。
①HTML、CSS：1ヶ月間　（10日）⇨（画像表示見直し4日かかったので実質14日）
②jQuery：1ヶ月間　　　（5/10から）⇨（5/14から）
③課題 1~4：1ヶ月間
④PHP：1.5ヶ月間
⑤課題 5~10：1.5ヶ月間
⑥最終課題：1ヶ月

jQueryのレッスン
・jQueryとは？　　　jQuery→Webサイトに動きをつける言語、javascriptをもっと便利にした言語
　　　　　　　　　　　Webサイトに動きをつける便利なツール。

・jQueryの読み込み方（途中）
//タイピングの練習

2024/05/11
//タイピングの練習
・jQueryの読み込み方

2024年5月12日
//タイピングの練習
復習
画像表示途中

2024年5月13日
//タイピングの練習
画像表示途中

2024年5月14日
画像表示OK
・HTML5/CSS3コース完了(画像表示完璧)4日かかったが。。

・jQueryとは？　
・jQueryの読み込み方（途中）

2024年5月15日
・jQueryの読み込み方（途中）

2024年5月16日
jQueryの読み込み方

2024年5月17日
・jQueryの始め方

2024年5月18日
・jQueryの始め方
・要素を表示、非表示する方法
・変数を宣言

2024年5月19日
・クラスの追加、削除
・hoverメソッド（途中）

2024年5月20日
//タイピングの練習
・クラスの追加、削除(復習)
・hoverメソッド
・クリックイベント
・クラスの追加、削除を繰り返す方法

2024年5月21日
・インデックスについて
・要素の文章を変更する
・属性や属性値を変更する


































