package test;

public class Study {
	public static void main(String[] args) {
//		System.out.println("Hello");

		
		//インクリメント、デクリメントの学習
		
		//1.実行結果として正しいもの
//		int a = 3;
//		int b = a += 5;
//		System.out.println(a + b);
//		
//		このJavaプログラムは、変数aとbの値を計算し、それらの合計を出力。
//		プログラムの流れは次の通りです：
//		1.int a = 3;で、変数aに3が代入されます。
//		2.int b = a += 5;で、aに5を加えた結果（aが8になる）が
//		bにも代入されます。この時点でaとbは両方とも8です。
//		3.System.out.println(a + b);で、aとbの合計、
//		つまり8 + 8が計算され、16が出力されます。
//		したがって、このプログラムは16を出力します。
		
		//⇨理解した！
		//そういうものなんだと理解する。
		
		
		//2.実行結果として正しいもの
//		int num = -10;
//		System.out.println(10 * -num);
//
//		
//		100が表示される理由完璧に理解したはず1
		
		//3.コンパイルエラーになるもの
		//今は分からないので飛ばします。
		
		//4.実行結果として正しいもの.
		//int a = 10;
		//int b = a++ + a + a-- - a-- + ++a;
		//System.out.println(b);
		
		//32が表示される理由は沢山復習したのでOKかと思う！

		
		//5.簡単すぎて書く必要がない気がしたので省略しました。
		
		//6.結果として正しいもの。
//		int a = 10;
//		int b = 10;
//		if (10 < a && 10 < ++b) {
//			a++;
//		}
//		System.out.println(a + b);
		
		//chatGPTの解説がおかしいため、飛ばす。。
		
//		//7.結果として正しいもの。
//		int a = 100, b = 20, c = 30;
//		System.out.println(a % b * c + a / b);
//
//		a % bは、aをbで割った余りです。
//		100 % 20は0です（100は20で割り切れます）。
//		この結果0にcを掛けます。0 * 30も0です。
//		a / bは、aをbで割った商です。100 / 20は5です。
//		最終的に、0 + 5は5です。
//		したがって、System.out.println(a % b * c + a / b);の出力は5です。
//		この計算結果は、算術演算がどのように行われるか
//		（割り算と余りの計算、乗算、そして加算の順）、そして演算の優先順位に基づいています。
//		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}
}